---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.#ctor
source: html/aa0d6228-b047-0362-9cdd-ff96522a6fa6.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.#ctor Method

Constructs a default instance of color settings.

## Syntax (C#)
```csharp
public AnalysisDisplayColorSettings()
```